<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Cosanostra-general] [cosanostra - General] Proyecto: se acaba el plazo
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/cosanostra-general/2005/index.html" >
   <LINK REL="made" HREF="mailto:cosanostra-general%40lists.berlios.de?Subject=Re%3A%20%5BCosanostra-general%5D%20%5Bcosanostra%20-%20General%5D%20Proyecto%3A%20se%20acaba%20el%20plazo&In-Reply-To=%3C200506200644.j5K6iPOe013597%40unicorn.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000018.html">
   <LINK REL="Next"  HREF="000020.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Cosanostra-general] [cosanostra - General] Proyecto: se acaba el plazo</H1>
    <B>noreply at berlios.de</B> 
    <A HREF="mailto:cosanostra-general%40lists.berlios.de?Subject=Re%3A%20%5BCosanostra-general%5D%20%5Bcosanostra%20-%20General%5D%20Proyecto%3A%20se%20acaba%20el%20plazo&In-Reply-To=%3C200506200644.j5K6iPOe013597%40unicorn.berlios.de%3E"
       TITLE="[Cosanostra-general] [cosanostra - General] Proyecto: se acaba el plazo">noreply at berlios.de
       </A><BR>
    <I>Mon Jun 20 08:44:25 CEST 2005</I>
    <P><UL>
        <LI>Previous message: <A HREF="000018.html">[Cosanostra-general] [cosanostra - General] ALGO MU IMPORTANTE!!!
</A></li>
        <LI>Next message: <A HREF="000020.html">[Cosanostra-general] [cosanostra - General] Pr&#243;xima quedada Cosa Nostra
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#19">[ date ]</a>
              <a href="thread.html#19">[ thread ]</a>
              <a href="subject.html#19">[ subject ]</a>
              <a href="author.html#19">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Read and respond to this message at: 
<A HREF="http://developer.berlios.de/forum/message.php?msg_id=18981">http://developer.berlios.de/forum/message.php?msg_id=18981</A>
By: s_a_m

Aunque la lista est&#233; perdida en el olvido, me he acordado de unos cuantos y
me he inventado la mayor&#237;a...

Lista de proyectos relacionados con &quot;3Dmiurgo&quot; + &quot;Sirope como puedas&quot;:


1.- adaptarlo a personas con discapacidad f&#237;sica. Con sonidos para ciegos...
lo he pensau, imposible. Ni con pantalla t&#225;ctil y q dijera objeto m&#225;s opciones...
no tiene sentido. &#191;Como sabe lo q hay en habita y lo que pede hacer con cada
cosa? Imposible... Por algo se le llama aventura GR&#193;FICA :P

2.- adaptarlo a personas con discapacidad ps&#237;quica (n.p.i.)

3.- mandar instrucciones a Vitto de otras formas: rat&#243;n. Necesita un &quot;pathfinder&quot;
con inteligencia artificial m&#237;nima, para que si clickeas en la estanter&#237;a, Vitto
sepa rodear el sof&#225; para llegar.

4.- mandar instrucciones a Vitto de otras formas: webcam. Como lo que ha hecho
Carlos Le&#243;n (la webcam se&#241;ala a un guante que tienes puesto y que da &#243;rdenes
en funci&#243;n de sus movimientos a un robot), pero dando instrucciones de coger,
usar, avanzar...

5.- puzzles generados por IA con conocimiento sem&#225;ntico con sentido. Se puede
hacer algo en plan prototipo sobre ello. Definiendo propiedades de los objetos,
que intentara mezclar s&#243;lo con sentido... lo malo son las cosas a lo &quot;abrir
PC para sacar florecita y d&#225;rsela al perro&quot;, con sentido pero irracionales.
No es imposible, GAIA est&#225; haciendo cosas chulas con los guiones din&#225;micos y
m&#225;s.

6.- resultados de los puzzles din&#225;micos, en funci&#243;n de comportamiento previo...
no cambia la estructura de estados, sino el resultado de las se&#241;ales. Al abrir
la caja fuerte puede haber uno o diez gallifantes, dependiendo de la hora del
d&#237;a, por ejemplo.... O mejor, que en funci&#243;n de variables externas, cambian
resultados... Un mes sin jugar, y Vincenzo ya no te habla, porque ha recibido
una se&#241;al del sistema para entrar en otro estado. La polla, molar&#237;a y da juego.
No est&#225; hecho y molar&#237;a mazo.

7.- plugin para exportar las posiciones, el tiro de c&#225;mara, la colocaci&#243;n de
objetos, las luces... desde maya al xml de gr&#225;ficos. Es lo que m&#225;s de p.m. nos
vendr&#237;a para nuestro juego, y es posible.

8.- si alguien se atreve... hacerlo multijugador, colaborando o competitivo,
haciendo que los estados que t&#250; cambies influyan en los del otro.

9.- que con variables externas Vitto genere patrones de comportamiento dirigidos
por l&#243;gica difusa xDDDD Si ser&#225; por fliparme... pero tambi&#233;n es posible. En
funci&#243;n de tu comportamiento, Vitto se vuelve m&#225;s r&#225;pido, m&#225;s nervioso, m&#225;s
torpe... &#191;A alguien se le ocurren m&#225;s aplicaciones? Hay mil.

10.- generaci&#243;n de lenguaje natural. En lugar de almacenar las frases tal cual,
s&#243;lo almacenas el concepto, y el programa genera las frases con sentido. Ta
gracioso, evita tener a un Pablito picando frases con y sin acentos en m&#225;quinas
de di&#225;logo eternas.

11.- introducir un sistema experto en algunos di&#225;logos, que puede hacerte preguntas,
y t&#250; responder con la informaci&#243;n que tengas... pero si te falta info sobre
algo, &#233;l no te dar&#225; tanta informaci&#243;n como podr&#237;a... da muxo juego. Si no tienes
un n&#250;mero o un nombre, no puedes seguir preguntando.

12.- interacci&#243;n web. Implementando la comunicaci&#243;n necesaria, entrelazar contenido
web din&#225;mico con los estados de la aventura, pudiendo mandar se&#241;ales de uno
a otro. Moooola un taco, pudiendo navegar m&#225;s a fondo en la web s&#243;lo si se ha
avanzado hasta aqu&#237; o hay&#225; en el juego... y viceversa, que con contenido interactivo
en la web pudiera cambiarse el estado de las cosas en el juego. No est&#225; hecho
y se sale.

13.- Aunque no sea multijugador (bajando a la tierra un poquito), s&#237; se le puede
dar soporte de red para hacer una comunidad alrededor, con servicios de foros,
chat, con trucos.. de los usuarios. Puede ser simult&#225;neo en plan consola de
TCL, o que Vitto se tenga que sentar en un ordena (estilo Day of the Tentacle
pa jugar al Maniac Mansion, que el prota se sentaba en un pc y se abr&#237;a este
otro juego). Es una mezcla curiosa, pa quien le mole el rollito.

14.- Generaci&#243;n de puzzles a partir de p&#225;rrafos en lenguaje natural, extrayendo
la informaci&#243;n &#250;til. Por ejemplo, le metes el walkthrough (gu&#237;a-soluci&#243;n de
una aventurA) del Monkey Island, y te genera el bicho los objetos y se&#241;ales
que se necesitan. La polla, la ostia, qu&#233; ideas se me ocurren a las 7:45 de
la madrugada xDDDDD No es tan flipada, no cre&#225;is: &quot;Entonces, cog&#237; el bote de
pintura y lo us&#233; con el capit&#225;n Drake dormido. Al despertarse, me di&#243; la moneda
que me faltaba&quot; --&gt;&gt; existen tres objetos: &quot;bote de pintura&quot;, &quot;capit&#225;n Drake&quot;
y &quot;moneda&quot;. &quot;Bote de pintura&quot; es cogible y usable. Si lo usas con Drake, pasa
a otro estado en el que te da la moneda. Y con esta informaci&#243;n, ya se tienen
objetos, estados y se&#241;ales de las que tanto nos molan.

15.- Hacer un buen servidor de sonido, c&#243;mo dec&#237;a Andriu. FMOD no puede usarse
si se quiere comercializar el producto. Nos vendr&#237;a guai.

16.- Hacer un motor gr&#225;fico xDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD
Ayz xD ayz... estar&#237;a guai, le quitar&#237;ais el trabajo a Lord Arkam, y fijo que
os sale mejor que el tru&#241;o de Nebula.

17.- hab&#237;a m&#225;s apuntadas, de aplicaciones gr&#225;ficas que se le hab&#237;an ocurrido
al Albert... pero nu macuerdo. Si os acord&#225;is, posteadlas.


Jooooder voy a suspender estad&#237;stica por pasarme horas invent&#225;ndome proyectos
:<i>-P Bien, hay unos cuantos. Tenemos de fecha l&#237;mite el 26 de junio s&#225;bado para
</I>proponerlos. Y hay que proponer, no s&#243;lo de qu&#233; va el proyecto, sino los tres
integrantes del grupo. He mandado un mail preguntando si la fecha es m&#225;s flexible,
si se puede enviar por mail, y si podr&#237;amos meter mano en la elecci&#243;n del profe
(si hubiera varios interesados, je..). Por favor, postead aqu&#237; los que est&#233;is
interesados, los grupos de tres, y los numeritos de los proyectos que os molar&#237;a
hacer (con prioridades). Sobre la dificultad de algunos, da igual, porque el
profe que lo acepte sabr&#225; lo suficiente del tema como para moderar nuestra locura.
Huelga decir que cada uno haga lo que quiera: si alguien quiere hacer un proyecto
que no tiene na q ver con estos, no prob. Pero quiero saber los que quereis
hacer un proyecto del videojuego para presentar las propuestas a la vez, porque
mi idea era presentarlas todas juntas, y con un pr&#243;logo com&#250;n jejeje. Si hay
varios grupos interesados en los mismos proyectos, pues ya decidir&#237;amos con
un poco de flexibilidad. Yo no pongo los que me molar&#237;an a mi porque deber&#237;a
consultar a los de mi grupo. Porfa, avisar a todos los que creais que puedan
estar interesados, que ahora en ex&#225;menes nadie (weno, casi nadie jeje) mira
el correo. Os linkeo aqu&#237; la info disponible en la web:

Para presentar propuestas de proyectos:
<A HREF="http://www.fdi.ucm.es/local/SI/AvisoProjectosAlumnos2005-06.pdf">http://www.fdi.ucm.es/local/SI/AvisoProjectosAlumnos2005-06.pdf</A>

Nueva normativa:
<A HREF="http://www.fdi.ucm.es/local/SI/NormativaSI-05-06.pdf">http://www.fdi.ucm.es/local/SI/NormativaSI-05-06.pdf</A>

Informaci&#243;n Sistemas Inform&#225;ticos del a&#241;o pasado:
<A HREF="http://www.fdi.ucm.es/local/SI/index.asp">http://www.fdi.ucm.es/local/SI/index.asp</A>


Sam


______________________________________________________________________
You are receiving this email because you elected to monitor this forum.
To stop monitoring this forum, login to BerliOS Developer and visit: 
<A HREF="http://developer.berlios.de/forum/monitor.php?forum_id=9530">http://developer.berlios.de/forum/monitor.php?forum_id=9530</A>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000018.html">[Cosanostra-general] [cosanostra - General] ALGO MU IMPORTANTE!!!
</A></li>
	<LI>Next message: <A HREF="000020.html">[Cosanostra-general] [cosanostra - General] Pr&#243;xima quedada Cosa Nostra
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#19">[ date ]</a>
              <a href="thread.html#19">[ thread ]</a>
              <a href="subject.html#19">[ subject ]</a>
              <a href="author.html#19">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/cosanostra-general">More information about the Cosanostra-general
mailing list</a><br>
</body></html>
